wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_fmc.c
        /* start page erase */
        FMC_CTL |= FMC_CTL_START;
        
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
        FMC_CTL &= ~FMC_CTL_PER;
        FMC_CTL &= ~FMC_CTL_PNSEL;
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      FMC erase bank0. It is valid only in dual bank mode.
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress 
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
fmc_state_enum fmc_bank0_erase(void)
{
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start chip erase */
        FMC_CTL |= FMC_CTL_MER0;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER0;
    }
    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      FMC erase bank1. It is valid only in dual bank mode.
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress  
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
fmc_state_enum fmc_bank1_erase(void)
{
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start chip erase */
        FMC_CTL |= FMC_CTL_MER1;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER1;
    }
    /* return the fmc state  */
    return fmc_state;
}

/*!
    \brief      FMC erase whole chip
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress  
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
fmc_state_enum fmc_mass_erase(void)
{
    uint32_t reg_value;
    
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        reg_value = FMC_CTL;
        reg_value |= (FMC_CTL_MER0|FMC_CTL_MER1|FMC_CTL_START);
        FMC_CTL = reg_value;              

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        reg_value = FMC_CTL;
        reg_value &= ~(FMC_CTL_MER0|FMC_CTL_MER1);
        FMC_CTL = reg_value;
    }
    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      program a double word at the given address in main flash
    \param[in]  address: address to program
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress 
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    data0 = (uint32_t)(data & 0xFFFFFFFFU);
    data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);

    if(FMC_READY == fmc_state) {
        /* set the PG bit to start program */
        FMC_CTL |= FMC_CTL_PG;
        REG32(address) = data0;
        __ISB();
        REG32(address + 4U) = data1;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the PG bit */
        FMC_CTL &= ~FMC_CTL_PG;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get base address of bank0
    \param[in]  none
    \param[out] none
    \retval     base address of bank0
*/
uint32_t fmc_bank0_base_address_get(void)
{
    uint32_t base_addr;   

    if(OB_DUAL_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        /* get the information about the bank swapping in syscfg */
        if(RESET == (SYSCFG_CFG0 & SYSCFG_CFG0_FMC_SWP)){
            base_addr = MAIN_FLASH_BASE_ADDRESS + MAIN_FLASH_BANK_SIZE * 0x400U;
        }else{
            base_addr = MAIN_FLASH_BASE_ADDRESS;
        }
    }else{
        base_addr = MAIN_FLASH_BASE_ADDRESS;
    }

    return base_addr;
}

/*!
    \brief      get base address of bank1. It is only valid when DBS=1.
    \param[in]  none
    \param[out] none
    \retval     base address of bank1
*/
uint32_t fmc_bank1_base_address_get(void)
{
    uint32_t base_addr;
    
    /* get the information about the bank swapping in syscfg */
    if(RESET == (SYSCFG_CFG0 & SYSCFG_CFG0_FMC_SWP)){
        base_addr = MAIN_FLASH_BASE_ADDRESS;
    }else{
        base_addr = MAIN_FLASH_BASE_ADDRESS + MAIN_FLASH_BANK_SIZE * 0x400U;
    }

    return base_addr;
}

/*!
    \brief      get page size
    \param[in]  none
    \param[out] none
    \retval     page size
*/
uint32_t fmc_page_size_get(void)
{
    uint32_t page_size;
    
    if(OB_DUAL_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        page_size = MAIN_FLASH_PAGE_SIZE_DBANK;
    }else{
        page_size = MAIN_FLASH_PAGE_SIZE_SBANK;
    }

    return page_size; 
}

/*!
    \brief      enable debugger
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_debugger_enable(void)
{
    FMC_WS |= FMC_WS_DBGEN;
}

/*!
    \brief      disable debugger
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_debugger_disable(void)
{
    FMC_WS &= ~FMC_WS_DBGEN;
}

/*!
    \brief      flash enter power down mode when MCU enter sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_slp_pd_mode_enable(void)
{
    FMC_WS |= FMC_WS_SLP_MDSEL;
}

/*!
    \brief      flash exit power down mode when MCU enter sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_slp_pd_mode_disable(void)
{
    FMC_WS &= ~FMC_WS_SLP_MDSEL;
}

/*!
    \brief      enable secure area protection 
    \param[in]  scr_area: secure area
                only one parameter can be selected which is shown as below:
      \arg        SCR_AREA0: the secure area of bank0
      \arg        SCR_AREA1: the secure area of bank1
    \param[out] none
    \retval     none
*/
void fmc_scr_area_enable(uint32_t scr_area)
{
    if(OB_DUAL_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        /* configure secure area size in dual bank mode */
        if(SCR_AREA0 == scr_area){
            FMC_CTL |= FMC_CTL_SCR0;
        }else{
            FMC_CTL |= FMC_CTL_SCR1;
        }
    }else{
        /* configure secure area size in single bank mode */   
        FMC_CTL |= FMC_CTL_SCR0;
    }
}

/*!
    \brief      unlock the option bytes operation
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET != (FMC_CTL & FMC_CTL_OBLK)){
        /* write the FMC ob unlock key */
        FMC_OBKEY = OB_UNLOCK_KEY0;
        FMC_OBKEY = OB_UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option bytes operation
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* set the OBLK bit */
    FMC_CTL |= FMC_CTL_OBLK;
}

/*!
    \brief      reload the option bytes operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reload(void)
{
    /* set the OBRLD bit */
    FMC_CTL |= FMC_CTL_OBRLD;
}

/*!
    \brief      program the option bytes USER
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_user: user option bytes. When write one paramter, the corresponding mask should be set.
                one or more (bitwise OR) parameters can be selected which are shown as below:
      \arg        OB_NRST_PIN_INPUT_MODE/OB_NRST_PIN_NORMAL_GPIO/OB_NRST_PIN_INPUT_OUTPUT_MODE: reset pin mode
      \arg        OB_NBOOT0_VALUE_0/OB_NBOOT0_VALUE_1: boot0 value 0 or value 1
      \arg        OB_NSWBOOT0_FROM_OB_BOOT0/OB_NSWBOOT0_FROM_PIN: boot by option byte value or by PB8/BOOT0 pin
      \arg        OB_TCMSRAM_ERASE_ENABLE/OB_TCMSRAM_ERASE_DISABLE: TCM SRAM erase or not when system reset
      \arg        OB_SRAM_ECC_ENABLE/OB_SRAM_ECC_DISABLE: SRAM and TCM SRAM ECC enable or disable
      \arg        OB_NBOOT1_VALUE_0/OB_NBOOT1_VALUE_1: boot1 value 0 or value 1
      \arg        OB_BB_DISABLE/OB_BB_ENABLE: boot bank value
      \arg        OB_STDBY_FWDGT_SUSPEND/OB_STDBY_FWDGT_RUN: free watchdog is suspended or running in standby mode
      \arg        OB_DPSLP_FWDGT_SUSPEND/OB_DPSLP_FWDGT_RUN: free watchdog is suspended or running in deep-sleep mode
      \arg        OB_FWDGT_HW/OB_FWDGT_SW: hardware or software free watchdog timer 
      \arg        OB_STDBY_RST/OB_STDBY_NRST: reset or not entering standby mode
      \arg        OB_DEEPSLEEP_RST/OB_DEEPSLEEP_NRST: reset or not entering deep sleep mode
      \arg        OB_BOR_TH_VALUE0/OB_BOR_TH_VALUE1/OB_BOR_TH_VALUE2/OB_BOR_TH_VALUE3: BOR threshold value
    \param[in]  ob_user_mask: user bits mask. They correspond to the above paramter value one by one. 
                  one or more (bitwise OR) parameters can be selected which are shown as below
      \arg        FMC_OBCTL_NRST_MDSEL: reset pin mode bit mask
      \arg        FMC_OBCTL_NBOOT0: NBOOT0 option bit mask
      \arg        FMC_OBCTL_NSWBT0: software BOOT0 bit mask
      \arg        FMC_OBCTL_TCMSRAM_ERS: TCM SRAM erase if system reset bit mask
      \arg        FMC_OBCTL_SRAM_ECCEN: SRAM and TCM SRAM ECC enable bit mask
      \arg        FMC_OBCTL_NBOOT1: NBOOT1 option bit mask
      \arg        FMC_OBCTL_BB: dual-bank boot bit mask
      \arg        FMC_OBCTL_FWDGSPD_STDBY: FWDGT suspend option in standby mode configuration bit mask
      \arg        FMC_OBCTL_FWDGSPD_DPSLP: FWDGT suspend option in deepsleep mode configuration bit mask
      \arg        FMC_OBCTL_NFWDG_HW: free watchdog configuration bit mask
      \arg        FMC_OBCTL_NRST_STDBY: option byte standby reset bit mask
      \arg        FMC_OBCTL_NRST_DPSLP: option byte deepsleep reset bit mask
      \arg        FMC_OBCTL_BOR_TH: BOR threshold status bits mask
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress  
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_user_write(uint32_t ob_user, uint32_t ob_user_mask)
{
    uint32_t obctl_reg;
    fmc_state_enum fmc_state = FMC_READY;

    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        fmc_state = FMC_OB_HSPC;
    }else{
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            obctl_reg = FMC_OBCTL;
            FMC_OBCTL = (obctl_reg & (~ob_user_mask)) | ob_user;
            FMC_CTL |= FMC_CTL_OBSTART;

            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        }
    }

    return fmc_state;
}

/*!
    \brief      configure security protection
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_spc: specify security protection
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress 
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
fmc_state_enum ob_security_protection_config(uint8_t ob_spc)
{
    uint32_t obctl_reg;
    fmc_state_enum fmc_state = FMC_READY;
        
    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        obctl_reg = FMC_OBCTL;

        /* reset the OBCTL_SPC, set according to ob_spc */
        obctl_reg &= ~FMC_OBCTL_SPC;
        obctl_reg |= (uint32_t)ob_spc;
        FMC_OBCTL = obctl_reg;
        FMC_CTL |= FMC_CTL_OBSTART;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option byte DCRP area
    \param[in]  dcrp_area: DCRP area
                only one parameter can be selected which is shown as below: 
      \arg        DCRP_AREA0: the DCRP area of bank0 when DBS=1 or the first area of whole memory when DBS=0
      \arg        DCRP_AREA1: the DCRP area of bank1 when DBS=1 or the second area of whole memory when DBS=0
    \param[in]  dcrp_eren: DCRP area erase enable bit
      \arg        OB_DCRP_AREA_ERASE_DISABLE: DCRP area is not erased when low security protection to no security protection
      \arg        OB_DCRP_AREA_ERASE_ENABLE: DCRP area is erased when low security protection to no security protection
    \param[in]  dcrp_start_addr: first doubleword of DCRP area address when DBS=1 or first 2 x doubleword of DCRP area when DBS=0
    \param[in]  dcrp_end_addr: last doubleword of DCRP area address when DBS=1 or last 2 x doubleword of DCRP area when DBS=0
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress   
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_dcrp_config(uint32_t dcrp_area, uint32_t dcrp_eren, uint32_t dcrp_start_addr, uint32_t dcrp_end_addr)
{
    uint32_t reg_value;
    uint32_t base_address;
    uint32_t dcrp_offset;
    fmc_state_enum fmc_state = FMC_READY;

    /* get base address */
    if(OB_SINGLE_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        base_address = MAIN_FLASH_BASE_ADDRESS;
        dcrp_offset = 4U;
    }else{
        if(DCRP_AREA0 == dcrp_area){
            base_address = fmc_bank0_base_address_get();
        }else{
            base_address = fmc_bank1_base_address_get();
        }
        dcrp_offset = 3U;
    }

    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        fmc_state = FMC_OB_HSPC;
    }else{
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            /* configure DCRP area0 */
            if(DCRP_AREA0 == dcrp_area){
                dcrp_start_addr = ((dcrp_start_addr - base_address) >> dcrp_offset);
                dcrp_end_addr = ((dcrp_end_addr - base_address) >> dcrp_offset);
                if(dcrp_start_addr == dcrp_end_addr){
                    fmc_state = FMC_OPRERR;
                }else{
                    FMC_DCRP_SADDR0 = dcrp_start_addr << DCRP_SADDR_DCRP_SADDR_OFFSET;

                    reg_value = FMC_DCRP_EADDR0;
                    reg_value &= ~FMC_DCRP_EADDR0_DCRP0_EREN;  
                    reg_value &= ~FMC_DCRP_EADDR0_DCRP0_EADDR;  
                    reg_value |= (dcrp_end_addr << DCRP_EADDR_DCRP_EADDR_OFFSET);
                    FMC_DCRP_EADDR0 = reg_value;
                }
            /* configure DCRP area1 */
            }else{
                dcrp_start_addr = ((dcrp_start_addr - base_address) >> dcrp_offset);
                dcrp_end_addr = ((dcrp_end_addr - base_address) >> dcrp_offset);
                if(dcrp_start_addr == dcrp_end_addr){
                    fmc_state = FMC_OPRERR;
                }else{
                    FMC_DCRP_SADDR1 = dcrp_start_addr << DCRP_SADDR_DCRP_SADDR_OFFSET;
                    FMC_DCRP_EADDR1 = dcrp_end_addr << DCRP_EADDR_DCRP_EADDR_OFFSET;
                }
            }

            if(FMC_READY == fmc_state){
                /* configure EREN */   
                reg_value = FMC_DCRP_EADDR0;
                reg_value &= ~FMC_DCRP_EADDR0_DCRP0_EREN;
                reg_value |= dcrp_eren;       
                FMC_DCRP_EADDR0 = reg_value;

                /* set the OBSTART bit in FMC_CTL register */
                FMC_CTL |= FMC_CTL_OBSTART;

                /* wait for the FMC ready */
                fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            }
        }
    }

    /* return the FMC state */
    return fmc_state;    
}
   
/*!
    \brief      configure the option byte write protection area
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        BK0WP_AREA0: the first area of bank0 when DBS=1 or the first area of whole memory when DBS=0
      \arg        BK0WP_AREA1: the second area of bank0 when DBS=1 or the second area of whole memory when DBS=0
      \arg        BK1WP_AREA0: the first area of bank1 when DBS=1 or the third area of whole memory when DBS=0
      \arg        BK1WP_AREA1: the second area of bank1 when DBS=1 or the fourth area of whole memory when DBS=0
    \param[in]  wp_start: first page of write protection area
    \param[in]  wp_end: last page of write protection area
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_write_protection_config(uint32_t wp_area, uint32_t wp_start, uint32_t wp_end)
{
    uint32_t value;
    fmc_state_enum fmc_state = FMC_READY;

    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        fmc_state = FMC_OB_HSPC;
    }else{
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            value = (wp_start << BKWP_BKWP_SADDR_OFFSET) | (wp_end << BKWP_BKWP_EADDR_OFFSET);
            value |= 0xFE00FF00U;
            /* configure the write protected area */
            if(BK0WP_AREA0 == wp_area){
                FMC_BK0WP0 = value;
            }else if(BK0WP_AREA1 == wp_area){
                FMC_BK0WP1 = value;
            }else if(BK1WP_AREA0 == wp_area){
                FMC_BK1WP0 = value;
            }else{
                FMC_BK1WP1 = value;
            }

            /* set the OBSTART bit in FMC_CTL register */
            FMC_CTL |= FMC_CTL_OBSTART;
            
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        }
    }

    /* return the FMC state */
    return fmc_state;     
}

/*!
    \brief      configure the option byte secure area
    \param[in]  scr_area: secure area 
                only one parameter can be selected which is shown as below:
      \arg        SCR_AREA0: the secure area of bank0
      \arg        SCR_AREA1: the secure area of bank1. It is useful only in dual bank mode.
    \param[in]  secure_size: size of secure area in page unit
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress   
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_scr_area_config(uint32_t scr_area, uint32_t secure_size)
{    
    uint32_t reg_value;
    fmc_state_enum fmc_state = FMC_READY;

