wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_fmc.c
    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        fmc_state = FMC_OB_HSPC;
    }else if(FMC_LSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        /* check the option bytes security protection value */
        fmc_state = FMC_OB_LSPC;
    }else{
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            if(OB_DUAL_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){ 
                /* configure secure area in dual bank mode */
                if(SCR_AREA0 == scr_area){
                    reg_value = FMC_BK0SCR;
                    reg_value &= ~FMC_BK0SCR_SCR_PAGE_CNT0;
                    reg_value |= secure_size << BKSCR_SCR_PAGE_CNT_OFFSET;
                    FMC_BK0SCR = reg_value;
                }else{
                    reg_value = FMC_BK1SCR;
                    reg_value &= ~FMC_BK1SCR_SCR_PAGE_CNT1;
                    reg_value |= secure_size << BKSCR_SCR_PAGE_CNT_OFFSET;
                    FMC_BK1SCR = reg_value;
                }
                
                /* set the OBSTART bit in FMC_CTL register */
                FMC_CTL |= FMC_CTL_OBSTART;
                
                /* wait for the FMC ready */
                fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            }else{
                /* configure secure area in single bank mode */ 
                if(SCR_AREA0 == scr_area){ 
                    reg_value = FMC_BK0SCR;
                    reg_value &= ~FMC_BK0SCR_SCR_PAGE_CNT0;
                    reg_value |= secure_size << BKSCR_SCR_PAGE_CNT_OFFSET;
                    FMC_BK0SCR = reg_value;
                    
                    /* set the OBSTART bit in FMC_CTL register */
                    FMC_CTL |= FMC_CTL_OBSTART;
                    
                    /* wait for the FMC ready */
                    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
                }
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option byte boot lock
    \param[in]  boot_config: boot configuration
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT_LOCK_FROM_MAIN_FLASH: boot from main flash
      \arg        OB_BOOT_UNLOCK: unlock boot
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_boot_lock_config(uint32_t boot_config)
{    
    uint32_t reg_value;
    fmc_state_enum fmc_state = FMC_READY;

    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)){
        fmc_state = FMC_OB_HSPC;
    }else{
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            reg_value = FMC_BK0SCR;
            reg_value &= ~FMC_BK0SCR_BOOTLK;
            reg_value |= boot_config;
            FMC_BK0SCR = reg_value;

            /* set the OBSTART bit in FMC_CTL register */
            FMC_CTL |= FMC_CTL_OBSTART;
            
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure FMC memory mapping swap bit
    \param[in]  swp_config: bank memory mapping swap configuration
                only one parameter can be selected which is shown as below:
      \arg        OB_BANK_MAPPING_SWAP: swap bank memory mapping.
      \arg        OB_BANK_MAPPING_NOT_SWAP: do not swap bank memory mapping.
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error 
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
      \arg        FMC_OB_HSPC: FMC is under high security protection 
      \arg        FMC_OB_LSPC: FMC is under low security protection
*/
fmc_state_enum ob_bank_memory_swap_config(uint32_t swp_config)
{
    uint32_t obctl_reg;
    fmc_state_enum fmc_state = FMC_READY;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        obctl_reg = FMC_OBCTL;

        /* configure FMC memory mapping swap bit  */
        obctl_reg &= ~FMC_OBCTL_FMC_SWP;
        obctl_reg |= (uint32_t)swp_config;
        FMC_OBCTL = obctl_reg;
        FMC_CTL |= FMC_CTL_OBSTART;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;    
}

/*!
    \brief      get the value of option bytes USER
    \param[in]  none
    \param[out] none
    \retval     the option bytes USER value
*/
uint32_t ob_user_get(void)
{
    /* return the FMC user option bytes value */
    return (uint32_t)(FMC_OBCTL >> OBCTL_USER_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes security protection level in FMC_OBCTL register
    \param[in]  none
    \param[out] none
    \retval     protection level
      \arg        FMC_NSPC: no protection
      \arg        FMC_LSPC: protection level low
      \arg        FMC_HSPC: protection level high
*/
uint8_t ob_security_protection_level_get(void)
{
    return (uint8_t)((FMC_OBCTL & FMC_OBCTL_SPC) >> OBCTL_SPC_OFFSET);
}

/*!
    \brief      get configuration of DCRP area 
    \param[in]  dcrp_area: DCRP area
                only one parameter can be selected which is shown as below: 
      \arg        DCRP_AREA0: the DCRP area of bank0 when DBS=1 or the first area of whole memory when DBS=0
      \arg        DCRP_AREA1: the DCRP area of bank1 when DBS=1 or the second area of whole memory when DBS=0
    \param[out] dcrp_erase_option: erase option of DCRP area
    \param[out] dcrp_area_start_addr: start address of DCRP area
    \param[out] dcrp_area_end_addr: end address of DCRP area
    \retval     state of address
      \arg        INVLD_AREA_ADDRESS: the area address is invalid
      \arg        VLD_AREA_ADDRESS: the area address is valid
*/
uint32_t ob_dcrp_area_get(uint32_t dcrp_area, uint32_t *dcrp_erase_option, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr)
{
    uint32_t start_dcrp;
    uint32_t end_dcrp;
    uint32_t base_address;
    uint32_t dcrp_size_unit;
    uint32_t result;

    /* get base address */
    if(OB_SINGLE_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        base_address = MAIN_FLASH_BASE_ADDRESS;
        dcrp_size_unit = 16U;
    }else{
        if(DCRP_AREA0 == dcrp_area){
            base_address = fmc_bank0_base_address_get();
        }else{
            base_address = fmc_bank1_base_address_get();
        }
        dcrp_size_unit = 8U;
    }

    if(DCRP_AREA0 == dcrp_area){
        start_dcrp = (FMC_DCRP_SADDR0 & FMC_DCRP_SADDR0_DCRP0_SADDR) >> DCRP_SADDR_DCRP_SADDR_OFFSET;
        end_dcrp = (FMC_DCRP_EADDR0 & FMC_DCRP_EADDR0_DCRP0_EADDR) >> DCRP_EADDR_DCRP_EADDR_OFFSET;
        *dcrp_erase_option = (FMC_DCRP_EADDR0 & FMC_DCRP_EADDR0_DCRP0_EREN) >> DCRP_EADDR_DCRP_EREN_OFFSET;
    }else{
        start_dcrp = (FMC_DCRP_SADDR1 & FMC_DCRP_SADDR1_DCRP1_SADDR) >> DCRP_SADDR_DCRP_SADDR_OFFSET;
        end_dcrp = (FMC_DCRP_EADDR1 & FMC_DCRP_EADDR1_DCRP1_EADDR) >> DCRP_EADDR_DCRP_EADDR_OFFSET;
    }

