wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_fmc.c
    /* get start address and end address of DCRP area */
    *dcrp_area_start_addr = base_address + start_dcrp * dcrp_size_unit;
    *dcrp_area_end_addr = base_address + (end_dcrp + 1U) * dcrp_size_unit - 1U;

    if(start_dcrp <= end_dcrp){
        /* the DCRP area is valid */
        result = VLD_AREA_ADDRESS;
    }else{
        /* the DCRP area is invalid */
        result = INVLD_AREA_ADDRESS;
    }
    
    return result;
}

/*!
    \brief      get address of write protection area
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        BK0WP_AREA0: the first area of bank0 when DBS=1 or the first area of whole memory when DBS=0
      \arg        BK0WP_AREA1: the second area of bank0 when DBS=1 or the second area of whole memory when DBS=0
      \arg        BK1WP_AREA0: the first area of bank1 when DBS=1 or the third area of whole memory when DBS=0
      \arg        BK1WP_AREA1: the second area of bank1 when DBS=1 or the fourth area of whole memory when DBS=0
    \param[out] wp_area_start_addr: start address of write protection area
    \param[out] wp_area_end_addr: end address of write protection area
    \retval     state of address
      \arg        INVLD_AREA_ADDRESS: the area address is invalid
      \arg        VLD_AREA_ADDRESS: the area address is valid
*/
uint32_t ob_write_protection_get(uint32_t wp_area, uint32_t *wp_area_start_addr, uint32_t *wp_area_end_addr)
{
    uint32_t start_wp;
    uint32_t end_wp;
    uint32_t base_address;
    uint32_t wp_size_unit;
    uint32_t result;

    /* get base address */
    if(OB_SINGLE_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        base_address = MAIN_FLASH_BASE_ADDRESS;
        wp_size_unit = MAIN_FLASH_PAGE_SIZE_SBANK;
    }else{
        if((BK0WP_AREA0 == wp_area) || (BK0WP_AREA1 == wp_area)){
            base_address = fmc_bank0_base_address_get();
        }else{
            base_address = fmc_bank1_base_address_get();
        }
        wp_size_unit = MAIN_FLASH_PAGE_SIZE_DBANK;
    }

    if(BK0WP_AREA0 == wp_area){
        start_wp = (FMC_BK0WP0 & FMC_BK0WP0_BK0WP0_SADDR) >> BKWP_BKWP_SADDR_OFFSET;
        end_wp = (FMC_BK0WP0 & FMC_BK0WP0_BK0WP0_EADDR) >> BKWP_BKWP_EADDR_OFFSET;
    }else if(BK0WP_AREA1 == wp_area){
        start_wp = (FMC_BK0WP1 & FMC_BK0WP1_BK0WP1_SADDR) >> BKWP_BKWP_SADDR_OFFSET;
        end_wp = (FMC_BK0WP1 & FMC_BK0WP1_BK0WP1_EADDR) >> BKWP_BKWP_EADDR_OFFSET;
    }else if(BK1WP_AREA0 == wp_area){            
        start_wp = (FMC_BK1WP0 & FMC_BK1WP0_BK1WP0_SADDR) >> BKWP_BKWP_SADDR_OFFSET;
        end_wp = (FMC_BK1WP0 & FMC_BK1WP0_BK1WP0_EADDR) >> BKWP_BKWP_EADDR_OFFSET;
    }else{
        start_wp = (FMC_BK1WP1 & FMC_BK1WP1_BK1WP1_SADDR) >> BKWP_BKWP_SADDR_OFFSET;
        end_wp = (FMC_BK1WP1 & FMC_BK1WP1_BK1WP1_EADDR) >> BKWP_BKWP_EADDR_OFFSET;
    }

    *wp_area_start_addr = base_address + start_wp * wp_size_unit;
    *wp_area_end_addr = base_address + (end_wp + 1U) * wp_size_unit - 1U;

    if(start_wp <= end_wp){
        /* the write protected area is valid */
        result = VLD_AREA_ADDRESS;
    }else{
        /* the write protected area is invalid */
        result = INVLD_AREA_ADDRESS;
    }
    
    return result;
}

/*!
    \brief      get size of secure area 
    \param[in]  scr_area: secure area 
                only one parameter can be selected which is shown as below:
      \arg        SCR_AREA0: the secure area of bank0
      \arg        SCR_AREA1: the secure area of bank1
    \param[out] scr_area_byte_cnt: secure area size in byte unit
    \retval     state of size
      \arg        INVLD_AREA_SIZE: the area size is invalid
      \arg        VLD_AREA_SIZE: the area size is valid
*/
uint32_t ob_scr_area_size_get(uint32_t scr_area, uint32_t *scr_area_byte_cnt)
{
    uint32_t reg_value = 0u;
    uint32_t scr_size_unit;
    uint32_t result = VLD_AREA_SIZE;    

    if(OB_DUAL_BANK_MODE == (FMC_OBCTL & FMC_OBCTL_DBS)){
        scr_size_unit = MAIN_FLASH_PAGE_SIZE_DBANK;

        /* get secure area size in dual bank mode */        
        if(SCR_AREA0 == scr_area){
            reg_value = (FMC_BK0SCR & FMC_BK0SCR_SCR_PAGE_CNT0) >> BKSCR_SCR_PAGE_CNT_OFFSET;
        }else{
            reg_value = (FMC_BK1SCR & FMC_BK1SCR_SCR_PAGE_CNT1) >> BKSCR_SCR_PAGE_CNT_OFFSET;
        }
        *scr_area_byte_cnt = reg_value * scr_size_unit;
        result = VLD_AREA_SIZE;
    }else{
        scr_size_unit = MAIN_FLASH_PAGE_SIZE_SBANK;

        /* get secure area size in single bank mode */ 
        if(SCR_AREA0 == scr_area){
            reg_value = (FMC_BK0SCR & FMC_BK0SCR_SCR_PAGE_CNT0) >> BKSCR_SCR_PAGE_CNT_OFFSET;
            *scr_area_byte_cnt = reg_value * scr_size_unit;
            result = VLD_AREA_SIZE;
        }else{
            result = INVLD_AREA_SIZE;
        }
    }
    
    return result;
}

/*!
    \brief      get boot configuration 
    \param[in]  none
    \param[out] none
    \retval     boot configuration
      \arg        OB_BOOT_LOCK_FROM_MAIN_FLASH: boot from main flash
      \arg        OB_BOOT_UNLOCK: unlock boot
*/
uint32_t ob_boot_config_get(void)
{
    return (uint32_t)(FMC_BK0SCR & FMC_BK0SCR_BOOTLK);
}

/*!
    \brief      get FMC flag status
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BUSY: FMC operation is in progress
      \arg        FMC_FLAG_OBERR: option byte read error
      \arg        FMC_FLAG_WPERR: erase/program protection error
      \arg        FMC_FLAG_PGSERR: program sequence error
      \arg        FMC_FLAG_PGMERR: program size error
      \arg        FMC_FLAG_PGAERR: program alignment error
      \arg        FMC_FLAG_RPERR: read protection error
      \arg        FMC_FLAG_PGERR: program error
      \arg        FMC_FLAG_OPRERR: operation error
      \arg        FMC_FLAG_ENDF: FMC end of operation flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

    if(FMC_STAT & flag){
        status = SET;
    }
    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear the FMC flag
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_OBERR: option byte read error
      \arg        FMC_FLAG_WPERR: erase/program protection error
      \arg        FMC_FLAG_PGSERR: program sequence error
      \arg        FMC_FLAG_PGMERR: program size error
      \arg        FMC_FLAG_PGAERR: program alignment error
      \arg        FMC_FLAG_RPERR: read protection error
      \arg        FMC_FLAG_PGERR: program error
      \arg        FMC_FLAG_OPRERR: operation error
      \arg        FMC_FLAG_ENDF: FMC end of operation flag
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(uint32_t flag)
{
    /* clear the flags */
    FMC_STAT |= flag;
}

/*!
    \brief      enable FMC interrupt
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_RPERR: read protection error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(uint32_t interrupt)
{
    FMC_CTL |= interrupt;
}

/*!
    \brief      disable FMC interrupt
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_RPERR: read protection error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(uint32_t interrupt)
{
    FMC_CTL &= ~interrupt;
}

/*!
    \brief      get ECC flag status
    \param[in]  flag: ECC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_ECCDET0: two-bit error detected flag(in 64bit LSB when DBS is 0)
      \arg        FMC_FLAG_ECCCOR0: one-bit error detected and corrected flag(in 64bit LSB when DBS is 0)
      \arg        FMC_FLAG_ECCDET1: two-bit error detected flag in 64bit MSB
      \arg        FMC_FLAG_ECCCOR1: one-bit error detected and corrected flag in 64bit MSB
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_ecc_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

    if(FMC_ECCCS & flag){
        status = SET;
    }
    /* return the state of corresponding ECC flag */
    return status;
}

/*!
    \brief      clear the ECC flag
    \param[in]  flag: ECC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_ECCDET0: two-bit error detected flag(in 64bit LSB when DBS is 0)
      \arg        FMC_FLAG_ECCCOR0: one-bit error detected and corrected flag(in 64bit LSB when DBS is 0)
      \arg        FMC_FLAG_ECCDET1: two-bit error detected flag in 64bit MSB
      \arg        FMC_FLAG_ECCCOR1: one-bit error detected and corrected flag in 64bit MSB
    \param[out] none
    \retval     none
*/
void fmc_ecc_flag_clear(uint32_t flag)
{
    uint32_t ecccorie;

    ecccorie = FMC_ECCCS & FMC_ECCCS_ECCCORIE;

    /* clear the flag */
    FMC_ECCCS = (flag | ecccorie);
}

/*!
    \brief      enable ECCCOR interrupt
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ecccor_interrupt_enable(void)
{
    FMC_ECCCS |= FMC_ECCCS_ECCCORIE;
}

/*!
    \brief      disable ECCCOR interrupt
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ecccor_interrupt_disable(void)
{
    FMC_ECCCS &= ~FMC_ECCCS_ECCCORIE;
}

/*!
    \brief      get ECCCOR interrupt flag 
    \param[in]  flag: ECCCOR interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_ECCCOR0: one-bit error detected and corrected flag
      \arg        FMC_INT_FLAG_ECCCOR1: one-bit error detected and corrected flag in 64bit MSB
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_ecccor_interrupt_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

    if(FMC_ECCCS & flag){
        status = SET;
    }

    /* return the state of ECCCOR interrupt flag */
    return status;
}

/*!
    \brief      clear ECCCOR interrupt flag
    \param[in]  flag: ECCCOR interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_ECCCOR0: one-bit error detected and corrected flag
      \arg        FMC_INT_FLAG_ECCCOR1: one-bit error detected and corrected flag in 64bit MSB
    \param[out] none
    \retval     none
*/
void fmc_ecccor_interrupt_flag_clear(uint32_t flag)
{
    /* clear the flag */
    FMC_ECCCS |= flag;
}

/*!
    \brief      get FMC interrupt flag
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_END: FMC end of operation interrupt flag
      \arg        FMC_INT_FLAG_OPRERR: FMC operation error interrupt flag
      \arg        FMC_INT_FLAG_RPERR: read protection error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

    if(FMC_STAT & flag){
        status = SET;
    }

    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear FMC interrupt flag
    \param[in]  flag: FMC interrupt flag
                one or more parameters can be selected which is shown as below:
      \arg        FMC_INT_FLAG_END: FMC end of operation interrupt flag
      \arg        FMC_INT_FLAG_OPRERR: FMC operation error interrupt flag
      \arg        FMC_INT_FLAG_RPERR: read protection error interrupt flag
    \param[out] none
    \retval     none
*/
void fmc_interrupt_flag_clear(uint32_t flag)
{
    /* clear the flag */
    FMC_STAT |= flag;
}

/*!
    \brief      get the FMC state
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
*/
static fmc_state_enum fmc_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_BUSY)){
        fmc_state = FMC_BUSY;
    }else{
        if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_WPERR)){
            fmc_state = FMC_WPERR;
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_PGERR)){
            fmc_state = FMC_PGERR;    
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_PGSERR)){
            fmc_state = FMC_PGSERR;   
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_PGAERR)){
            fmc_state = FMC_PGAERR;   
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_RPERR)){
            fmc_state = FMC_RPERR;
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_PGMERR)){
            fmc_state = FMC_PGMERR;
        }else if((uint32_t)0x00U != (FMC_STAT & FMC_STAT_OBERR)){
            fmc_state = FMC_OBERR;
        }else {
            /* illegal parameters */
        }
  }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC is ready or not
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: FMC operation has been completed
      \arg        FMC_BUSY: FMC operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: FMC timeout error
*/
static fmc_state_enum fmc_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_BUSY;

    /* wait for FMC ready */
    do{
        /* get FMC state */
        fmc_state = fmc_state_get();
        timeout--;
    }while((FMC_BUSY == fmc_state) && (0x00U != timeout));

    if(FMC_BUSY == fmc_state){
        fmc_state = FMC_TOERR;
    }
    /* return the FMC state */
    return fmc_state;
}
